# FailureMessageKey Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailureMessageKey Constructor
FailureMessageKey Class See Also
---
Constructs a new FailureMessageKey with default settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public FailureMessageKey()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
FailureMessageKey()
```

# See Also
FailureMessageKey Class
Autodesk.Revit.DB Namespace